/* Main header for tx-isp-t31.ko */

#ifndef MAIN_H
#define MAIN_H

/* Architecture Information */
#define ARCH_BITS 32
#define ARCH_ENDIAN LITTLE
#define BASE_ADDRESS 0x10000

/* Function Declarations */
#include "functions.h"

/* Type Definitions */

/* Platform Types */
#include <stdint.h>
#include <stdbool.h>

#ifndef __cplusplus
#ifndef _STDBOOL_H
enum {
    false = 0,
    true = 1
};
typedef _Bool bool;
#endif
#endif

/* ELF and System Types - Prevent incomplete type errors */
#ifndef ELF_TYPES_DEFINED
#define ELF_TYPES_DEFINED

struct Elf32_Ident {
    unsigned char ei_mag[4];     // Magic number
    unsigned char ei_class;      // File class
    unsigned char ei_data;       // Data encoding
    unsigned char ei_version;    // File version
    unsigned char ei_osabi;      // OS/ABI identification
    unsigned char ei_abiversion; // ABI version
    unsigned char ei_pad[7];     // Padding
};

#ifndef ET_NONE
enum e_type {
    ET_NONE = 0,    // No file type
    ET_REL = 1,     // Relocatable file
    ET_EXEC = 2,    // Executable file
    ET_DYN = 3,     // Shared object file
    ET_CORE = 4     // Core file
};
#endif

#ifndef EM_NONE
enum e_machine {
    EM_NONE = 0,     // No machine
    EM_M32 = 1,      // AT&T WE 32100
    EM_SPARC = 2,    // SPARC
    EM_386 = 3,      // Intel 80386
    EM_68K = 4,      // Motorola 68000
    EM_MIPS = 8,     // MIPS
    EM_ARM = 40,     // ARM
    EM_X86_64 = 62   // AMD x86-64
};
#endif

#ifndef PT_NULL
enum p_type {
    PT_NULL = 0,     // Program header table entry unused
    PT_LOAD = 1,     // Loadable program segment
    PT_DYNAMIC = 2,  // Dynamic linking information
    PT_INTERP = 3,   // Program interpreter
    PT_NOTE = 4      // Auxiliary information
};
#endif

#ifndef PF_X
enum p_flags {
    PF_X = 1,        // Execute
    PF_W = 2,        // Write
    PF_R = 4         // Read
};
#endif

#ifndef SHT_NULL
enum sh_type {
    SHT_NULL = 0,     // Section header table entry unused
    SHT_PROGBITS = 1, // Program data
    SHT_SYMTAB = 2,   // Symbol table
    SHT_STRTAB = 3,   // String table
    SHT_NOBITS = 8    // Program space with no data (bss)
};
#endif

#ifndef SHF_WRITE
enum sh_flags {
    SHF_WRITE = 1,    // Writable
    SHF_ALLOC = 2,    // Occupies memory during execution
    SHF_EXECINSTR = 4 // Executable
};
#endif

#endif /* ELF_TYPES_DEFINED */

typedef uint32_t DWORD;
typedef uint16_t WORD;
typedef uint8_t BYTE;

/* User-Defined Types */
typedef struct Elf32_Header {
    struct Elf32_Ident ident; // offset: 0x0
    enum e_type type; // offset: 0x10
    enum e_machine machine; // offset: 0x12
    uint32_t version; // offset: 0x14
    void (*entry)(void); // offset: 0x18
    uint32_t program_header_offset; // offset: 0x1c
    uint32_t section_header_offset; // offset: 0x20
    uint32_t flags; // offset: 0x24
    uint16_t header_size; // offset: 0x28
    uint16_t program_header_size; // offset: 0x2a
    uint16_t program_header_count; // offset: 0x2c
    uint16_t section_header_size; // offset: 0x2e
    uint16_t section_header_count; // offset: 0x30
    uint16_t string_table; // offset: 0x32
} Elf32_Header;

typedef struct Elf32_Ident_Alt {
    char signature[4]; // offset: 0x0
    uint8_t file_class; // offset: 0x4
    uint8_t encoding; // offset: 0x5
    uint8_t version; // offset: 0x6
    uint8_t os; // offset: 0x7
    uint8_t abi_version; // offset: 0x8
    char pad[7]; // offset: 0x9
} Elf32_Ident_Alt;

typedef struct Elf32_ProgramHeader {
    enum p_type type; // offset: 0x0
    uint32_t offset; // offset: 0x4
    uint32_t virtual_address; // offset: 0x8
    uint32_t physical_address; // offset: 0xc
    uint32_t file_size; // offset: 0x10
    uint32_t memory_size; // offset: 0x14
    enum p_flags flags; // offset: 0x18
    uint32_t align; // offset: 0x1c
} Elf32_ProgramHeader;

typedef struct Elf32_SectionHeader {
    uint32_t name; // offset: 0x0
    enum sh_type type; // offset: 0x4
    enum sh_flags flags; // offset: 0x8
    uint32_t address; // offset: 0xc
    uint32_t offset; // offset: 0x10
    uint32_t size; // offset: 0x14
    uint32_t link; // offset: 0x18
    uint32_t info; // offset: 0x1c
    uint32_t align; // offset: 0x20
    uint32_t entry_size; // offset: 0x24
} Elf32_SectionHeader;

// Type: va_list
typedef void* va_list;


/* Global Data Variables */

// Data at address 0x10004
char data_10004[] = { 0xc4, 0x2c, 0x42, 0x8c, 0xd0, 0xff, 0xbd, 0x27, 0x2b, 0x10, 0x82, 0x00, 0x28, 0x00, 0xb1, 0xaf, 0x2c, 0x00, 0xbf, 0xaf, 0x24, 0x00, 0xb0, 0xaf, 0x38, 0x00, 0xa6, 0xaf, 0x3c, 0x00, 0xa7, 0xaf, 0x14, 0x00, 0x40, 0x14 }; // offset: 0x10004

// Data at address 0x10028
char data_10028[] = { 0xa2, 0x00, 0x38, 0x00, 0x00, 0x88, 0x25 }; // offset: 0x10028

// Data at address 0x7a170
extern void* __ksymtab_isp_printf; // Fixed function pointer assignment

// Data at address 0x7a178
extern void* __ksymtab_private_capable; // Fixed function pointer assignment

// Data at address 0x7a180
extern void* __ksymtab_private_clk_disable; // Fixed function pointer assignment

// Data at address 0x7a188
extern void* __ksymtab_private_clk_enable; // Fixed function pointer assignment

// Data at address 0x7a190
